app/controllers/products_controller.rb

INSERT INTO "products" ("name", "quantity", "cost_price", "sell_price", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Mercadoria1"], ["quantity", 5], ["cost_price", 2.5], ["sell_price", 10.0], ["status", "t"], ["created_at", "2017-08-19 18:17:21.572536"], ["updated_at", "2017-08-19 18:17:21.572536"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "quantity" = ?, "cost_price" = ?, "sell_price" = ?, "status" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["quantity", 10], ["cost_price", 15.0], ["sell_price", 20.0], ["status", "f"], ["updated_at", "2017-08-19 18:43:50.236752"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)